SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mz_nvic.c

#include "pic32mz_nvic.h"

#define PIC32MZ_NVIC_NONE_ACTIVE -1
#define PIC32MZ_NVIC_LOWEST_PRIO -1
#define PIC32MZ_NVIC_HIGHEST_PRIO 7
#define PIC32MZ_NVIC_HIGHEST_SUB_PRIO 3
#define PIC32MZ_NVIC_LOWEST_SUB_PRIO 0
// #define DEBUG_NVIC
// We may not want to allow nested interrupts
#define DISABLE_NESTED_INTERRUPTS

uint32_t pic32mz_interrupt_limit = 0;
uint32_t pic32mz_num_config_disabled_interrupts = 0;
uint32_t *pic32mz_config_disabled_interrupts = NULL;
uc_hook pic32mz_nvic_block_hook_handle = -1, pic32mz_nvic_exception_return_hook_handle=-1,
    pic32mz_hook_mmio_write_handle = -1, pic32mz_hook_mmio_read_handle = -1;
uint32_t pic32mz_nesting_detector = 0;

// 3. Dynamic State (required for state restore)
struct Pic32mzNVIC pic32mz_nvic __attribute__ ((aligned (64))) = {
    .vtor = PIC32MZ_EBASE, // an idle assignment, we don't need this actually
    .NonPersistantIRQs = {0,1,2,3,4,7,8,9,12,13,14,17,18,19,22,23,24,27,28,31,32,35,36,39,40,43,104,130,131,134,135,136,137,138,139,140,141,166,167},
    .num_enabled = 0
};

// forward declaration
static bool pic32mz_recalc_prios();
static void pic32mz_ExceptionEntry(uc_engine *uc);
bool pic32mz_is_disabled_by_config(int exception_no);
static void pic32mz_core_software_interrupt_controller(uc_engine *uc);
void pic32mz_update_enabled_irq_list(int irq);


__attribute__ ((hot))
static void pic32mz_nvic_block_hook(uc_engine *uc, uint64_t address, uint32_t size, struct Pic32mzNVIC* arg_nvic) {
        

        #ifdef DISABLE_NESTED_INTERRUPTS
            // Hack: prevent nested interrupt from happening
            if (pic32mz_nesting_detector == 1){
                if ((uint32_t)address == arg_nvic->EPC){
                    pic32mz_nesting_detector = 0;
                }else{
                    return;
                }
            }
        #endif
        

            pic32mz_core_software_interrupt_controller(uc);
            #ifdef DISABLE_NESTED_INTERRUPTS
            if( arg_nvic->active_irq == PIC32MZ_NVIC_NONE_ACTIVE ) {
            #endif
                pic32mz_ExceptionEntry(uc);
            #ifdef DISABLE_NESTED_INTERRUPTS
            }
            #endif
        
}


//  Hack: we need to manually detect if any core software interrupt request
//  since generally they are not configured in interrupt control MMIO range but in CP0 cause register
//  Cause: application code doesn't set up prioritization for these, we, by default, prioritize them in a manner, like lowest irq with highest prio
//  In the meanwhile, we assume these two are in higher priority than other interrupt sources
static void pic32mz_core_software_interrupt_controller(uc_engine *uc){
    PIC32MZ_CP0_cause CP0_cause;
    uc_reg_read(uc, UC_MIPS_REG_CP0_CAUSE, &CP0_cause);
    // core software interrupt 0
    if (CP0_cause.IP0){
        // Caution: only execute once
        if (pic32mz_nvic.InterruptEnabled[PIC32MZ_IRQ_Core_Software_Interrupt_0] == 0){
            pic32mz_nvic.InterruptEnabled[PIC32MZ_IRQ_Core_Software_Interrupt_0] = 1;
            pic32mz_nvic.InterruptPriority[PIC32MZ_IRQ_Core_Software_Interrupt_0] = PIC32MZ_NVIC_HIGHEST_PRIO;
            pic32mz_nvic.InterruptSubPriority[PIC32MZ_IRQ_Core_Software_Interrupt_0] = PIC32MZ_NVIC_HIGHEST_SUB_PRIO;
            pic32mz_update_enabled_irq_list(PIC32MZ_IRQ_Core_Software_Interrupt_0);
        }
        pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Software_Interrupt_0] = 1;
        pic32mz_recalc_prios();
    }else{
            // In general cases, ISR code will clear pending bit via a MMIO write to the interrupt controller
            // then this handling is redundant
            #ifdef DEBUG_NVIC
            if (pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Software_Interrupt_0] == 1){
                printf("[core_software_interrupt_controller] unpending irq 1\n");
                fflush(stdout);
            }
            #endif


        pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Software_Interrupt_0] = 0;
    }

    // core software interrupt 1
    if (CP0_cause.IP1){
        if (pic32mz_nvic.InterruptEnabled[PIC32MZ_IRQ_Core_Software_Interrupt_1] == 0){
            pic32mz_nvic.InterruptEnabled[PIC32MZ_IRQ_Core_Software_Interrupt_1] = 1;
            pic32mz_nvic.InterruptPriority[PIC32MZ_IRQ_Core_Software_Interrupt_1] = PIC32MZ_NVIC_HIGHEST_PRIO;
            pic32mz_nvic.InterruptSubPriority[PIC32MZ_IRQ_Core_Software_Interrupt_1] = PIC32MZ_NVIC_HIGHEST_SUB_PRIO-1;
            pic32mz_update_enabled_irq_list(PIC32MZ_IRQ_Core_Software_Interrupt_1);
        }
        pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Software_Interrupt_1] = 1;
    }else{
            #ifdef DEBUG_NVIC
            if (pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Software_Interrupt_1] == 1){
                printf("[core_software_interrupt_controller] unpending irq 2\n");
                fflush(stdout);
            }
            #endif

        pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Software_Interrupt_1] = 0;
    }

    // core timer interrupt 0
    if (CP0_cause.TI){
        if (pic32mz_nvic.InterruptEnabled[PIC32MZ_IRQ_Core_Timer] == 0){
            pic32mz_nvic.InterruptEnabled[PIC32MZ_IRQ_Core_Timer] = 1;
            pic32mz_nvic.InterruptPriority[PIC32MZ_IRQ_Core_Timer] = PIC32MZ_NVIC_HIGHEST_PRIO;
            pic32mz_nvic.InterruptSubPriority[PIC32MZ_IRQ_Core_Timer] = PIC32MZ_NVIC_HIGHEST_SUB_PRIO-1;
            pic32mz_update_enabled_irq_list(PIC32MZ_IRQ_Core_Timer);
        }
        pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Timer] = 1;
    }else{
            #ifdef DEBUG_NVIC
            if (pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Timer] == 1){
                printf("[core timer interrupt] unpending irq 0\n");
                fflush(stdout);
            }
            #endif

        pic32mz_nvic.InterruptPending[PIC32MZ_IRQ_Core_Timer] = 0;
    }
    

}

// Hack: we update status here by a given IRQ 
// because MMIO accesses don't indicate an IRQ
void pic32mz_pend_interrupt(uc_engine *uc, int exception_no) {
    #ifdef DEBUG_NVIC
    printf("[pend_interrupt] irq=%d, active_irq=%d\n", exception_no, pic32mz_nvic.active_irq);
    fflush(stdout);
    #endif
    if(pic32mz_nvic.InterruptPending[exception_no] == 0) {
        pic32mz_nvic.InterruptPending[exception_no] = 1;

        // set IFSx bit
        // int index = exception_no / 32;
        // uint32_t value;
        // uc_reg_read(uc, PIC32MZ_EBASE + PIC32MZ_IFS0 + index * 0x10, &value);
        // value = PIC32MZ_Set_Bit(value, exception_no % 32);
        // uc_reg_write(uc, PIC32MZ_EBASE + PIC32MZ_IFS0 + index * 0x10, &value);

        // read enabled bit in IEC registers
        // uc_reg_read(uc, PIC32MZ_EBASE + PIC32MZ_IEC0 + index * 0x10, &value);
        // pic32mz_nvic.InterruptEnabled[exception_no] = PIC32MZ_Get_Bit(value, exception_no % 32);



        pic32mz_recalc_prios();
    }else if (pic32mz_nvic.InterruptPending[exception_no] == 1 && \
    pic32mz_nvic.InterruptEnabled[exception_no] == 1){
        pic32mz_recalc_prios();
    }
}


static void pic32mz_ExceptionEntry(uc_engine *uc) {  
    // interrupt trigger sends an IRQ too early and the actual enabling of interrupts hasn't been done.
    if (pic32mz_nvic.pending_irq == PIC32MZ_NVIC_NONE_ACTIVE) return;

    #ifdef DEBUG_NVIC
    printf("[NVIC] ExceptionEntry\n"); fflush(stdout);
    #endif

