SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mz_nvic.c
    if (pic32mz_nvic.active_irq != PIC32MZ_NVIC_NONE_ACTIVE){
        // CAUTION: preempting an existing interrupt
        // we come into a nested interrupt process

        bool is_persistant = true;
        // Or we just care about persistant interrupts
        for (int i = 0; i < sizeof(pic32mz_nvic.NonPersistantIRQs)/sizeof(pic32mz_nvic.NonPersistantIRQs[0]); i++){
            if ((uint8_t)pic32mz_nvic.pending_irq == pic32mz_nvic.NonPersistantIRQs[i]){
                is_persistant = false;
                break;
            }
        }
        
        // we can't take precedence
        if(is_persistant) 
        {
            #ifdef DEBUG_NVIC
                printf("[NVIC] The current IRQ is not preemptable!\n"); fflush(stdout);
            #endif
            return;
        }

        // due to X32 compiler prologue automatically preserves context for the further interrupts,
        // we don't need to handle anything, but inform the emulator
        #ifdef DEBUG_NVIC
            printf("[NVIC] Preempting an existing interrupt!\n"); fflush(stdout);
        #endif
    }
    
    // Store the current PC in EPC
    uint32_t epc;
    uc_reg_read(uc, UC_MIPS_REG_PC, &epc);
    uc_reg_write(uc, UC_MIPS_REG_CP0_EPC, &epc);
    pic32mz_nvic.EPC = epc;

    // Find the ISR entry point and set it
    // EPC to return
    uint32_t ExceptionNumber = pic32mz_nvic.pending_irq;
    uint32_t isr_entry = PIC32MZ_EBASE;
    uint32_t OFFx = PIC32MZ_OFF000 + 4 * ExceptionNumber ;
    uint32_t ISR_offset;
    
    uc_mem_read(uc, PIC32MZ_INTR_CTL_REG_MMIO_BASE + OFFx, &ISR_offset, sizeof(ISR_offset));
    isr_entry += ISR_offset; //e.g., 0x9d000000 + 0x200
    uc_reg_write(uc, UC_MIPS_REG_PC, &isr_entry);

    #ifdef DEBUG_NVIC
    printf("Redirecting irq %d to isr: %08x, EPC: %08x\n", ExceptionNumber, isr_entry, epc);
    #endif

    // Update pic32mz_nvic state with new active interrupt
    // pic32mz_nvic.InterruptPending[ExceptionNumber] = 0;
    // we clear pending bit in a MMIO write access to IFSxCLR
    pic32mz_nvic.active_irq = ExceptionNumber;

    // We need to re-calculate the pending priority state
    pic32mz_recalc_prios();

    #ifdef DEBUG_NVIC
    puts("************ POST ExceptionEntry");
    print_state(uc);
    #endif

}

uint16_t pic32mz_get_num_enabled() {
    return pic32mz_nvic.num_enabled;
}

uint8_t pic32mz_nth_enabled_irq_num(uint8_t n) {
    return pic32mz_nvic.enabled_irqs[n % pic32mz_nvic.num_enabled];
}

void pic32mz_nvic_set_pending(uc_engine *uc, uint32_t irq, int delay_activation) {
    pic32mz_pend_interrupt(uc, irq);
    // maybe_activate(uc, false);
}


void * pic32mz_nvic_take_snapshot(uc_engine *uc) {
    size_t size = sizeof(pic32mz_nvic);

    // NVIC snapshot: save the sysreg mem page
    char *result = malloc(size + PAGE_SIZE);
    memcpy(result, &pic32mz_nvic, size);
    uc_mem_read(uc, PIC32MZ_INTR_CTL_REG_MMIO_BASE, result + size, PAGE_SIZE);

    return result;
}

void pic32mz_nvic_restore_snapshot(uc_engine *uc, void *snapshot) {
    // Restore the pic32mz_nvic
    memcpy(&pic32mz_nvic, snapshot, sizeof(pic32mz_nvic));
    // Restore the sysreg mem page
    uc_mem_write(uc, PIC32MZ_INTR_CTL_REG_MMIO_BASE, ((char *) snapshot) + sizeof(pic32mz_nvic), PAGE_SIZE);
}

void pic32mz_nvic_discard_snapshot(uc_engine *uc, void *snapshot) {
    free(snapshot);
}


/*
 * Re-calculate pic32mz_nvic interrupt prios and determine the next interrupt
 * (i.e., a higher-prio interrupt is now pending)
 */
static bool pic32mz_recalc_prios() {
    int highest_pending_prio = PIC32MZ_NVIC_LOWEST_PRIO;
    int highest_pending_sub_prio = PIC32MZ_NVIC_LOWEST_PRIO;
    int highest_pending_irq = PIC32MZ_NVIC_NONE_ACTIVE;
    

    // iterate all enabled and pending interrupts
    // sort the highest irq out
    // the active interrupt should be excluded
    for(int i = 0; i < pic32mz_nvic.num_enabled; ++i) {
        int irq = pic32mz_nvic.enabled_irqs[i];
        int curr_prio = pic32mz_nvic.InterruptPriority[irq];
        int curr_sub_prio = pic32mz_nvic.InterruptSubPriority[irq];
        
        #ifdef DEBUG_NVIC
           printf("[recalc_prios] irq:%d,  irq_prio:%d, irq_sub_prio:%d\n", irq, curr_prio, curr_sub_prio);
        #endif

        if(pic32mz_nvic.InterruptPending[irq] && pic32mz_nvic.active_irq != irq) {
            if (curr_prio > highest_pending_prio) {
                #ifdef DEBUG_NVIC
                printf("[recalc_prios] curr_prio > highest_pending_prio for irq %d: curr: %d > new highest: %d\n", irq, curr_prio, highest_pending_prio);
                #endif

                highest_pending_prio = curr_prio;
                highest_pending_sub_prio = curr_sub_prio;
                highest_pending_irq = irq;
            }
            else if (curr_prio == highest_pending_prio){
                // Further compare sub-priority
                if (curr_sub_prio > highest_pending_sub_prio) {

                    highest_pending_prio = curr_prio;
                    highest_pending_sub_prio = curr_sub_prio;
                    highest_pending_irq = irq;

                    #ifdef DEBUG_NVIC
                    printf("[recalc_prios] curr_sub_prio > highest_pending_sub_prio for irq %d: curr: %d > new highest: %d\n", irq, curr_sub_prio, highest_pending_sub_prio);
                    #endif
                }
            }
        }

        // TODO: consider the case for no active irq, and adjust highest pending one

    }


    pic32mz_nvic.pending_prio = highest_pending_prio;
    pic32mz_nvic.pending_sub_prio = highest_pending_sub_prio;
    pic32mz_nvic.pending_irq = highest_pending_irq;

    // no change
    if (highest_pending_irq == PIC32MZ_NVIC_LOWEST_PRIO)
        return false;

    return true;
}


void pic32mz_update_enabled_irq_list(int irq){
    int i = 0;

    for(; i < pic32mz_nvic.num_enabled; ++i) {
        if(pic32mz_nvic.enabled_irqs[i] == irq) {
            return;
        }
    }

    i = 0;
    for(; i < pic32mz_nvic.num_enabled; ++i) {
        if(pic32mz_nvic.enabled_irqs[i] > irq) {
            memmove(&pic32mz_nvic.enabled_irqs[i+1], &pic32mz_nvic.enabled_irqs[i], (pic32mz_nvic.num_enabled-i) * sizeof(pic32mz_nvic.enabled_irqs[0]));
            break;
        }
    }

    pic32mz_nvic.enabled_irqs[i] = irq;
    ++pic32mz_nvic.num_enabled;

    #ifdef DEBUG_NVIC
    printf("[update_enabled_irq_list] \n");
    for(i=0; i < pic32mz_nvic.num_enabled; ++i) {
        printf("irq = %d\n", pic32mz_nvic.enabled_irqs[i]);
    }
    fflush(stdout);
    #endif

