SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mz_nvic.c
}


void pic32mz_update_enabled_interrupts(uc_engine *uc, uint32_t IEC_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;

    // Hack: we not only record enabled interrupts but also update their priority in pic32mz_nvic
    // in most cases, priority is defined before the interrupt is enabled

    while (cur_bit < 32){
        if (PIC32MZ_Get_Bit(value, cur_bit) == 1){

            irq = IEC_index * 32 + cur_bit;

            if(pic32mz_is_disabled_by_config(irq)) break;
            
            pic32mz_nvic.InterruptEnabled[irq] = 1;

            pic32mz_update_enabled_irq_list(irq);


            break;
        }
        cur_bit ++;
    }

}


void pic32mz_update_disabled_irq_list(int irq){
    

    for(int i = 0; i < pic32mz_nvic.num_enabled; ++i) {
        if(pic32mz_nvic.enabled_irqs[i] == irq) {
            pic32mz_nvic.num_enabled--;
            // we don't care about the last position
            if (i != (PIC32MZ_NVIC_NUM_SUPPORTED_INTERRUPTS - 1) )
            memmove(&pic32mz_nvic.enabled_irqs[i], &pic32mz_nvic.enabled_irqs[i+1], (pic32mz_nvic.num_enabled-i) * sizeof(pic32mz_nvic.enabled_irqs[0]));
            
            #ifdef DEBUG_NVIC
            printf("remove irq %d from the list\n", irq);
            fflush(stdout);
            #endif
            
            break;
        }
    }

}


// along the execution, some interrupts maybe disabled in firmware logic
void pic32mz_update_disabled_interrupts(uc_engine *uc, uint32_t IEC_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;

    // Hack: we not only record enabled interrupts but also update their priority in pic32mz_nvic
    // in most cases, priority is defined before the interrupt is enabled

    while (cur_bit < 32){
        if (PIC32MZ_Get_Bit(value, cur_bit) == 1){

            irq = IEC_index * 32 + cur_bit;

            if(pic32mz_is_disabled_by_config(irq)) break;
            
            pic32mz_nvic.InterruptEnabled[irq] = 0;

            pic32mz_update_disabled_irq_list(irq);


            break;
        }
        cur_bit ++;
    }

}




void pic32mz_update_enabled_interrupts_priority(uc_engine *uc, uint32_t offset, uint32_t priority){
        uint32_t index = ((offset & ~(0xf)) - PIC32MZ_IPC0 )/ 0x10;
        int irq = index * 4;
        // update priority
        // priority, sub-priority

            // uc_mem_read(uc, PIC32MZ_INTR_CTL_REG_MMIO_BASE + PIC32MZ_IPC0 + index * 0x10 + PIC32MZ_OFFSET_IPCxSET, &priority, 4);

        if (PIC32MZ_Prio_0(priority) != 0){
            
            if(pic32mz_is_disabled_by_config(irq)) return;
            
            // pic32mz_nvic.InterruptEnabled[irq] = 1;

            // pic32mz_update_enabled_irq_list(irq);

            pic32mz_nvic.InterruptPriority[irq] = PIC32MZ_Prio_0(priority);
            pic32mz_nvic.InterruptSubPriority[irq] = PIC32MZ_Sub_Prio_0(priority);
        }
        else if(PIC32MZ_Prio_1(priority) != 0){
            irq += 1;
            if(pic32mz_is_disabled_by_config(irq)) return;
            
            // pic32mz_nvic.InterruptEnabled[irq] = 1;

            // pic32mz_update_enabled_irq_list(irq);

            pic32mz_nvic.InterruptPriority[irq] = PIC32MZ_Prio_1(priority);
            pic32mz_nvic.InterruptSubPriority[irq] = PIC32MZ_Sub_Prio_1(priority);
        }
        else if (PIC32MZ_Prio_2(priority) != 0){
            irq += 2;
            if(pic32mz_is_disabled_by_config(irq)) return;
            
            // pic32mz_nvic.InterruptEnabled[irq] = 1;

            // pic32mz_update_enabled_irq_list(irq);
            pic32mz_nvic.InterruptPriority[irq] = PIC32MZ_Prio_2(priority);
            pic32mz_nvic.InterruptSubPriority[irq] = PIC32MZ_Sub_Prio_2(priority);
        }
        else if (PIC32MZ_Prio_3(priority) != 0){
            irq += 3;

            if(pic32mz_is_disabled_by_config(irq)) return;
            
            // pic32mz_nvic.InterruptEnabled[irq] = 1;

            // pic32mz_update_enabled_irq_list(irq);

            pic32mz_nvic.InterruptPriority[irq] = PIC32MZ_Prio_3(priority);
            pic32mz_nvic.InterruptSubPriority[irq] = PIC32MZ_Sub_Prio_3(priority);
        }
            
        #ifdef DEBUG_NVIC
            printf("[update interrupt priority] irq = %d, priority = %d, sub-priority = %d\n", irq, pic32mz_nvic.InterruptPriority[irq], pic32mz_nvic.InterruptSubPriority[irq]);
            fflush(stdout);
        #endif
    
} 

void pic32mz_update_pending_interrupts(uint32_t IFS_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;

    while (cur_bit < 32){
        if (PIC32MZ_Get_Bit(value, cur_bit) == 1){
            irq = IFS_index * 32 + cur_bit;
            pic32mz_nvic.InterruptPending[irq] = 1;
            break;
        }

        cur_bit ++;
    }
}


void pic32mz_clear_interrupts(uint32_t IFSxCLR_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;
    while (cur_bit < 32){
        if (PIC32MZ_Get_Bit(value, cur_bit) == 1){
            irq = IFSxCLR_index * 32 + cur_bit;
            pic32mz_nvic.InterruptPending[irq] = 0;

            // Hack: consider as an exception exit
            if (pic32mz_nvic.active_irq == irq) {
                pic32mz_nvic.active_irq = PIC32MZ_NVIC_NONE_ACTIVE;
                    #ifdef DEBUG_NVIC
                    printf("[NVIC] setting irq %d as non-active \n", irq);
                    fflush(stdout);
                    #endif
                // check if any pending interrupts
                pic32mz_nesting_detector = pic32mz_recalc_prios();
            }
            break;
        }

        cur_bit ++;
    }
}



void pic32mz_hook_sysctl_mmio_write(uc_engine *uc, uc_mem_type type,
                        uint64_t addr, int size, int64_t value, void *user_data) {
    #ifdef DEBUG_NVIC
    printf("[NVIC] hook_sysctl_mmio_write: Write to %08lx, value: %08lx\n", addr, value);
    fflush(stdout);
    #endif                     
    

    // identify which interrupt control register to be written
    uint32_t offset = addr & 0xFFF;

