SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mz_nvic.c
    switch(offset) {     
        // interrupt flags
        case PIC32MZ_IFS0:
            pic32mz_update_pending_interrupts(0, value);
            break;
        case PIC32MZ_IFS1:
            pic32mz_update_pending_interrupts(1, value);
            break;
        case PIC32MZ_IFS2:
            pic32mz_update_pending_interrupts(2, value);
            break;
        case PIC32MZ_IFS3:
            pic32mz_update_pending_interrupts(3, value);
            break;
        case PIC32MZ_IFS4:
            pic32mz_update_pending_interrupts(4, value);
            break;
        case PIC32MZ_IFS5:
            pic32mz_update_pending_interrupts(5, value);
            break;

        // interrupt mask
        // Hack: once a write to the below registers corresponding to 
        // we then iterate enabled interrupts through this register, each register records 32 IRQ
        case PIC32MZ_IEC0:
            pic32mz_update_enabled_interrupts(uc, 0, value);
            break;
        case PIC32MZ_IEC1:
            pic32mz_update_enabled_interrupts(uc, 1, value);
            break;
        case PIC32MZ_IEC2:
            pic32mz_update_enabled_interrupts(uc, 2, value);
            break;
        case PIC32MZ_IEC3:
            pic32mz_update_enabled_interrupts(uc, 3, value);
            break;
        case PIC32MZ_IEC4:
            pic32mz_update_enabled_interrupts(uc, 4, value);
            break;
        case PIC32MZ_IEC5:
            pic32mz_update_enabled_interrupts(uc, 5, value);
            break;

        // enable an interrupt
        // same as above, but some system code utilizes this register
        case PIC32MZ_IEC0 + PIC32MZ_OFFSET_IECxSET:
            pic32mz_update_enabled_interrupts(uc, 0, value);
            break;
        case PIC32MZ_IEC1 + PIC32MZ_OFFSET_IECxSET:
            pic32mz_update_enabled_interrupts(uc, 1, value);
            break;
        case PIC32MZ_IEC2 + PIC32MZ_OFFSET_IECxSET:
            pic32mz_update_enabled_interrupts(uc, 2, value);
            break;
        case PIC32MZ_IEC3 + PIC32MZ_OFFSET_IECxSET:
            pic32mz_update_enabled_interrupts(uc, 3, value);
            break;
        case PIC32MZ_IEC4 + PIC32MZ_OFFSET_IECxSET:
            pic32mz_update_enabled_interrupts(uc, 4, value);
            break;
        case PIC32MZ_IEC5 + PIC32MZ_OFFSET_IECxSET:
            pic32mz_update_enabled_interrupts(uc, 5, value);
            break;        

        // disable an interrupt
        case PIC32MZ_IEC0 + PIC32MZ_OFFSET_IECxCLR:
            pic32mz_update_disabled_interrupts(uc, 0, value);
            break;
        case PIC32MZ_IEC1 + PIC32MZ_OFFSET_IECxCLR:
            pic32mz_update_disabled_interrupts(uc, 1, value);
            break;
        case PIC32MZ_IEC2 + PIC32MZ_OFFSET_IECxCLR:
            pic32mz_update_disabled_interrupts(uc, 2, value);
            break;
        case PIC32MZ_IEC3 + PIC32MZ_OFFSET_IECxCLR:
            pic32mz_update_disabled_interrupts(uc, 3, value);
            break;
        case PIC32MZ_IEC4 + PIC32MZ_OFFSET_IECxCLR:
            pic32mz_update_disabled_interrupts(uc, 4, value);
            break;
        case PIC32MZ_IEC5 + PIC32MZ_OFFSET_IECxCLR:
            pic32mz_update_disabled_interrupts(uc, 5, value);
            break;            

        // interrupt CLR register at the offset of 4 bytes in the associated register, e.g., IFS0CLR
        // crucial to terminate an ISR by setting as non-active
        case PIC32MZ_IFS0CLR:
            pic32mz_clear_interrupts(0, value);
            break;
        case PIC32MZ_IFS1CLR:
            pic32mz_clear_interrupts(1, value);
            break;
        case PIC32MZ_IFS2CLR:
            pic32mz_clear_interrupts(2, value);
            break;
        case PIC32MZ_IFS3CLR:
            pic32mz_clear_interrupts(3, value);
            break;
        case PIC32MZ_IFS4CLR:
            pic32mz_clear_interrupts(4, value);
            break;
        case PIC32MZ_IFS5CLR:
            pic32mz_clear_interrupts(5, value);
            break;       


        case (PIC32MZ_IPC0 + PIC32MZ_OFFSET_IPCxSET) ... (PIC32MZ_IPC53 + PIC32MZ_OFFSET_IPCxSET):
            // interrupt priority
            pic32mz_update_enabled_interrupts_priority(uc, offset, value);
            break;
        case PIC32MZ_OFF000 ... (PIC32MZ_OFF000 + 4*PIC32MZ_NUM_OFFX): break;
            // OFFx registers
        case PIC32MZ_INTCON:    break;
        case PIC32MZ_INTSTAT:   break;
        default: break;
    }


}

bool pic32mz_is_disabled_by_config(int exception_no) {
    for(int i = 0; i < pic32mz_num_config_disabled_interrupts; ++i) {
        if(pic32mz_config_disabled_interrupts[i] == exception_no) {
            return true;
        }
    }

    return false;
}


uc_err pic32mz_init_nvic(uc_engine *uc, uint32_t vtor, uint32_t num_irq, uint32_t p_interrupt_limit, uint32_t num_disabled_interrupts, uint32_t *disabled_interrupts) {
    #ifdef DEBUG_NVIC
    printf("[NVIC] init_nvic called with vtor: %x, num_irq: %d\n", vtor, num_irq); fflush(stdout);
    #endif

    if(num_irq > PIC32MZ_NVIC_NUM_SUPPORTED_INTERRUPTS) {
        num_irq = PIC32MZ_NVIC_NUM_SUPPORTED_INTERRUPTS;
    }


    pic32mz_nvic.active_irq = PIC32MZ_NVIC_NONE_ACTIVE;
    pic32mz_nvic.pending_irq = PIC32MZ_NVIC_NONE_ACTIVE;
    pic32mz_nvic.pending_sub_prio = PIC32MZ_NVIC_LOWEST_PRIO;
    pic32mz_nvic.pending_prio = PIC32MZ_NVIC_LOWEST_PRIO;

    pic32mz_nvic.interrupt_count = 0;
    pic32mz_interrupt_limit = p_interrupt_limit;
    pic32mz_num_config_disabled_interrupts = num_disabled_interrupts;

    pic32mz_config_disabled_interrupts = calloc(num_disabled_interrupts, sizeof(*disabled_interrupts));

    for(uint32_t i = 0; i < num_disabled_interrupts; ++i)
        // save disabled IRQs
        pic32mz_config_disabled_interrupts[i] = disabled_interrupts[i];
    

    uc_hook_add(uc, &pic32mz_nvic_block_hook_handle, UC_HOOK_BLOCK_UNCONDITIONAL, pic32mz_nvic_block_hook, &pic32mz_nvic, 1, 0);
    
    // pic32mz_nvic MMIO range write handler to update status
    uc_hook_add(uc, &pic32mz_hook_mmio_write_handle, UC_HOOK_MEM_WRITE, pic32mz_hook_sysctl_mmio_write, NULL, PIC32MZ_INTR_CTL_REG_MMIO_BASE, PIC32MZ_INTR_CTL_REG_MMIO_END);
    // uc_hook_add(uc, &pic32mz_hook_mmio_read_handle, UC_HOOK_MEM_READ, pic32mz_hook_sysctl_mmio_read, NULL, PIC32MZ_INTR_CTL_REG_MMIO_BASE, PIC32MZ_INTR_CTL_REG_MMIO_END);

    subscribe_state_snapshotting(uc, pic32mz_nvic_take_snapshot, pic32mz_nvic_restore_snapshot, pic32mz_nvic_discard_snapshot);

    return UC_ERR_OK;
}